Конфигурация/InformationRegisters/ДатыЗапретаРедактирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДатыЗапретаРедактирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапретаРедактирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаЗапрета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыЗапретаРедактирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/CommonModules/РаботаСФормамиКлиент/Ext/Module.bsl
&НаКлиенте
Процедура РазвернутьВсеЭлементыДерева(ДанныеДерево, ТаблицаФормы) Экспорт
	
	Для каждого Элемент Из ДанныеДерево.ПолучитьЭлементы() Цикл
		ТаблицаФормы.Развернуть(Элемент.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры // РазвернутьВсеЭлементыДерева

&НаКлиенте
Процедура СвернутьВсеЭлементыДерева(ДанныеДерево, ТаблицаФормы) Экспорт
	
	Для каждого Элемент Из ДанныеДерево.ПолучитьЭлементы() Цикл
		
		СвернутьВсеЭлементыДерева(Элемент, ТаблицаФормы);
		
		ТаблицаФормы.Свернуть(Элемент.ПолучитьИдентификатор());
		
	КонецЦикла;
	
КонецПроцедуры // СвернутьВсеЭлементыДерева

&НаКлиенте
Процедура ПолучитьКлючиРазвернутыхСтрокДерева(ДанныеДерево, ТаблицаФормы, ПолеКлюча = "Ключ", КлючиРазвернутыхСтрок) Экспорт
	
	Если ТипЗнч(КлючиРазвернутыхСтрок) <> Тип("Массив") Тогда
		КлючиРазвернутыхСтрок = Новый Массив();
	КонецЕсли;
	
	Для каждого Элемент Из ДанныеДерево.ПолучитьЭлементы() Цикл
		
		ЭлементРазвернут = ТаблицаФормы.Развернут(Элемент.ПолучитьИдентификатор());
		
		Если ЭлементРазвернут <> Неопределено И ЭлементРазвернут Тогда
			КлючиРазвернутыхСтрок.Добавить(Элемент[ПолеКлюча]);
		КонецЕсли;
		
		ПолучитьКлючиРазвернутыхСтрокДерева(Элемент, ТаблицаФормы, ПолеКлюча, КлючиРазвернутыхСтрок);
		
	КонецЦикла;
	
КонецПроцедуры // ПолучитьКлючиРазвернутыхСтрокДерева

&НаКлиенте
Процедура ВосстановитьРазвернутыеСтрокиДереваПоКлючу(ДанныеДерево, ТаблицаФормы, ПолеКлюча = "Ключ", КлючиРазвернутыхСтрок) Экспорт
	
	Если ТипЗнч(КлючиРазвернутыхСтрок) <> Тип("Массив") Или КлючиРазвернутыхСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Элемент Из ДанныеДерево.ПолучитьЭлементы() Цикл
		
		Если КлючиРазвернутыхСтрок.Найти(Элемент[ПолеКлюча]) <> Неопределено Тогда
			ТаблицаФормы.Развернуть(Элемент.ПолучитьИдентификатор());
		КонецЕсли;
		
		ВосстановитьРазвернутыеСтрокиДереваПоКлючу(Элемент, ТаблицаФормы, ПолеКлюча, КлючиРазвернутыхСтрок);
		
	КонецЦикла;
	
КонецПроцедуры // ВосстановитьРазвернутыеСтрокиДереваПоКлючу

&НаКлиенте
Функция ПолучитьКлючТекущейСтроки(ТаблицаФормы, ПолеКлюча = "Ключ") Экспорт
	
	ТекущиеДанные = ТаблицаФормы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ТекущиеДанные[ПолеКлюча];
	
КонецФункции // ПолучитьКлючТекущейСтроки

&НаКлиенте
Процедура ВосстановитьТекущуюСтрокуПоКлючу(ДанныеФормы, ТаблицаФормы, ПолеКлюча = "Ключ", КлючТекущейСтроки) Экспорт
	
	Если ПолеКлюча = "" Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеФормы) = Тип("ДанныеФормыДерево") Или ТипЗнч(ДанныеФормы) = Тип("ДанныеФормыЭлементДерева") Тогда
		
		Для каждого Элемент Из ДанныеФормы.ПолучитьЭлементы() Цикл
			
			Если Элемент[ПолеКлюча] = КлючТекущейСтроки Тогда
				
				ТаблицаФормы.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
				
				ПолеКлюча = "";
				
				Возврат;
				
			КонецЕсли;
			
			ВосстановитьТекущуюСтрокуПоКлючу(Элемент, ТаблицаФормы, ПолеКлюча, КлючТекущейСтроки);
			
			Если ПолеКлюча = "" Тогда
				Возврат;
			КонецЕсли;
			
		КонецЦикла;

	ИначеЕсли ТипЗнч(ДанныеФормы) = Тип("ДанныеФормыКоллекция") Тогда
		
		Для каждого Элемент Из ДанныеФормы Цикл
			Если Элемент[ПолеКлюча] = КлючТекущейСтроки Тогда
				ТаблицаФормы.ТекущаяСтрока = Элемент.ПолучитьИдентификатор();
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ВосстановитьТекущуюСтрокуПоКлючу

////////////////////////////////////////////////////////////////////////////////

Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка, Модифицированность) Экспорт
	
	Если Модифицированность Тогда
		ТекстПредупреждения = "Закрыть форму без сохранения изменений?";
		Если ЗавершениеРаботы ИЛИ Вопрос(ТекстПредупреждения, РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Функции для обработки действий пользователя в процессе редактирования
// многострочного текста, например комментария в документах.

// Открывает форму редактирования произвольного многострочного текста модально.
//
// Параметры:
//  МногострочныйТекст      - Строка - произвольный текст, который необходимо отредактировать;
//  РезультатРедактирования - Строка - в этот параметр будет помещен результат редактирования;
//  Модифицированность      - Строка - флаг модифицированности формы;
//  Заголовок               - Строка - текст, который необходимо отобразить в заголовке формы.
//
Процедура ОткрытьФормуРедактированияМногострочногоТекста(Знач МногострочныйТекст, РезультатРедактирования, Модифицированность = Ложь, 
		Знач Заголовок = Неопределено) Экспорт
	
	Если Заголовок = Неопределено Тогда
		ТекстВведен = ВвестиСтроку(МногострочныйТекст,,, Истина);
	Иначе
		ТекстВведен = ВвестиСтроку(МногострочныйТекст, Заголовок,, Истина);
	КонецЕсли;
	
	Если Не ТекстВведен Тогда
		Возврат;
	КонецЕсли;
		
	РезультатРедактирования = МногострочныйТекст;
	Если Не Модифицированность Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму редактирования многострочного комментария модально.
//
// Параметры:
//  МногострочныйТекст      - Строка - произвольный текст, который необходимо отредактировать
//  РезультатРедактирования - Строка - переменная, в которую будет помещен результат редактирования
//  Модифицированность       - Строка - флаг модифицированности формы
//
// Пример использования:
//  ОткрытьФормуРедактированияКомментария(Элемент.ТекстРедактирования, Объект.Комментарий, Модифицированность);
//
Процедура ОткрытьФормуРедактированияКомментария(Знач МногострочныйТекст, РезультатРедактирования,
	Модифицированность = Ложь) Экспорт
	
	ОткрытьФормуРедактированияМногострочногоТекста(МногострочныйТекст, РезультатРедактирования, Модифицированность, 
		НСтр("ru='Комментарий'"));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

// Выводит результат выполнения какой-либо операции
//
// Параметры:
//   ЭтаФорма (УправляемаяФорма) Форма, для которой требуется вывод.
//   Результат (Структура) Результат выполнения операции, который необходимо вывести.
//       |- ВыводОповещения (Структура)
//           |- Использование (Булево) Выводить оповещение.
//           |- Заголовок     (Строка)
//           |- Ссылка        (Строка) Навигационная гиперссылка.
//           |- Текст         (Строка)
//           |- Картинка      (Картинка)
//       |- ВыводСообщения (Структура)
//           |- Использование       (Булево) Выводить сообщение.
//           |- Текст               (Строка)
//           |- ПутьКРеквизитуФормы (Строка) Путь к реквизиту формы, к которому относится сообщение.
//       |- ВыводПредупреждения (Структура)
//           |- Использование       (Булево) Выводить предупреждение.
//           |- Текст               (Строка)
//           |- ТекстОшибок         (Строка) Необязательный. Тексты ошибок, которые при желании может просмотреть пользователь.
//           |- ПутьКРеквизитуФормы (Строка) Необязательный. Путь к реквизиту формы, значение которого вызывало ошибку.
//       |- ОповещениеФорм (Структура) см. справку к методу глобального контекста Оповестить().
//           |- Использование (Булево) Оповещать открытые формы.
//           |- ИмяСобытия    (Строка) Имя события, которое используется для первичной идентификации сообщений принимающими формами.
//           |- Параметр      (*) Набор данных, которые используются принимающей формой для обновления состава.
//           |- Источник      (*) Источник оповещения, например форма-источником.
//       |- ОповещениеДинамическихСписков (Структура) см. справку к методу глобального контекста ОповеститьОбИзменении().
//           |- Использование (Булево) Оповещать динамические списки.
//           |- СсылкаИлиТип  (*) Ссылка, тип, или массив типов, которые необходимо обновить.
//
// Описание:
//   Предназначен только для отображения результата работы сервера на клиенте,
//   не предназначен для отображения промежуточных стадий - диалогов и т.п.
//
// См. также:
//   РаботаСФормамиКлиентСервер.НовыйРезультатВыполнения()
//   РаботаСФормамиКлиентСервер.ПодготовитьОповещениеДинамическихСписков()
//
Процедура ПоказатьРезультатВыполнения(ЭтаФорма, Результат) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") И ТипЗнч(Результат) <> Тип("ФиксированнаяСтруктура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("ВыводОповещения") И Результат.ВыводОповещения.Использование Тогда
		Оповещение = Результат.ВыводОповещения;
		ПоказатьОповещениеПользователя(Оповещение.Заголовок, Оповещение.Ссылка, Оповещение.Текст, Оповещение.Картинка);
	КонецЕсли;
	
	Если Результат.Свойство("ВыводСообщения") И Результат.ВыводСообщения.Использование Тогда
		Сообщение = Новый СообщениеПользователю;
		Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
			Сообщение.ИдентификаторНазначения = ЭтаФорма.УникальныйИдентификатор;
		КонецЕсли;
		Сообщение.Текст = Результат.ВыводСообщения.Текст;
		Сообщение.Поле  = Результат.ВыводСообщения.ПутьКРеквизитуФормы;
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если Результат.Свойство("ВыводПредупреждения") И Результат.ВыводПредупреждения.Использование Тогда
		Если ЗначениеЗаполнено(Результат.ВыводПредупреждения.ТекстОшибок) Тогда
			Кнопки = Новый СписокЗначений;
			Кнопки.Добавить(1, НСтр("ru = 'Показать ошибки'"));
			
			Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") И ЗначениеЗаполнено(Результат.ВыводПредупреждения.ПутьКРеквизитуФормы) Тогда
				Кнопки.Добавить(2, НСтр("ru = 'Перейти к реквизиту'"));
			КонецЕсли;
			
			Кнопки.Добавить(0, НСтр("ru = 'Продолжить'"));
			
			Ответ = Вопрос(Результат.ВыводПредупреждения.Текст, Кнопки, , 1);
			
			Если Ответ = 1 Тогда
				
				ЗаголовокДокумента = Результат.ВыводПредупреждения.Текст;
				ЗаголовокДокумента = СтрЗаменить(ЗаголовокДокумента, Символы.ПС, "; ");
				Если СтрДлина(ЗаголовокДокумента) > 75 Тогда
					ЗаголовокДокумента = Лев(ЗаголовокДокумента, 72) + "...";
				КонецЕсли;
				
				ТекстовыйДокумент = Новый ТекстовыйДокумент;
				ТекстовыйДокумент.УстановитьТекст(Результат.ВыводПредупреждения.ТекстОшибок);
				ТекстовыйДокумент.Показать(ЗаголовокДокумента);
				
			ИначеЕсли Ответ = 2 Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.ИдентификаторНазначения = ЭтаФорма.УникальныйИдентификатор;
				Сообщение.Текст = Результат.ВыводПредупреждения.Текст;
				Сообщение.Поле  = Результат.ВыводПредупреждения.ПутьКРеквизитуФормы;
				Сообщение.Сообщить();
				
			КонецЕсли;
			
		Иначе
			Предупреждение(Результат.ВыводПредупреждения.Текст);
		КонецЕсли;
	КонецЕсли;
	
	Если Результат.Свойство("ОповещениеФорм") И Результат.ОповещениеФорм.Использование Тогда
		Оповестить(Результат.ОповещениеФорм.ИмяСобытия, Результат.ОповещениеФорм.Параметр, Результат.ОповещениеФорм.Источник);
	КонецЕсли;
	
	Если Результат.Свойство("ОповещениеДинамическихСписков") И Результат.ОповещениеДинамическихСписков.Использование Тогда
		Если ТипЗнч(Результат.ОповещениеДинамическихСписков.СсылкаИлиТип) = Тип("Массив") Тогда
			Для Каждого СсылкаИлиТип Из Результат.ОповещениеДинамическихСписков.СсылкаИлиТип Цикл
				ОповеститьОбИзменении(СсылкаИлиТип);
			КонецЦикла;
		Иначе
			ОповеститьОбИзменении(Результат.ОповещениеДинамическихСписков.СсылкаИлиТип);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

Функция СформироватьЗаголовокПриложения() Экспорт
	
	ТекущаяОрганизация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущаяОрганизация, "ПрефиксНумерации, Наименование, ЗаголовокСистемы");
	
	КлючСистемы = ?(ПустаяСтрока(РеквизитыОрганизации.ПрефиксНумерации), РеквизитыОрганизации.Наименование, РеквизитыОрганизации.ПрефиксНумерации);
	
	Если ПустаяСтрока(РеквизитыОрганизации.ЗаголовокСистемы) Тогда
		РеквизитыОрганизации.ЗаголовокСистемы = РаботаСМетаданнымиПовтИсп.ПолучитьСинонимКонфигурации();
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ЗначениеПараметраСеанса("ЭтоРабочаяИнформационнаяБаза") Тогда
		// чтобы не налажать, работая на боевой вместо копии, отобразим сведения о копии в заголовке
		ИмяИнфБазы = СистемныеФункции.ПолучитьИмяИнформационноБазы();
		Возврат "(КОПИЯ - " + СтрЗаменить(ИмяИнфБазы, "AssetManagement", "") +  ") " + КлючСистемы + " - " + РеквизитыОрганизации.ЗаголовокСистемы;
	Иначе
		Возврат КлючСистемы + " - " + РеквизитыОрганизации.ЗаголовокСистемы;
	КонецЕсли;
	
КонецФункции // СформироватьЗаголовокПриложения

Процедура ЗаполнитьПараметрыРаботыКлиентаПриЗавершении() Экспорт

	// позже можно будет поместить параметр в регистр сведений ЗначенияНастроекПользователей
	ПараметрыРаботыКлиентаПриЗавершении.Вставить("ПоказыватьПредупреждениеПередЗавершениемРаботыСистемы", ОбщегоНазначения.ЗначениеПараметраСеанса("ЭтоРабочаяИнформационнаяБаза"));

КонецПроцедуры

Процедура ПровестиПоБухгалтерскомуУчету(ЭтаФорма) Экспорт

	Если ЭтаФорма.Модифицированность Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение по бухгалтерскому учету возможно только для не модифицированного документа");
		
	Иначе
		
		ПараметрыФормы = Новый Структура("Документ", ЭтаФорма.Объект.Ссылка);
		ОткрытьФормуМодально("ОбщаяФорма.ФормаПроведенияПоБухгалтерскомуУчету", ПараметрыФормы, ЭтаФорма);
	
	КонецЕсли;

КонецПроцедуры

Функция ПоказатьДеревоЗначений(АдресДереваЗначений, ТекстПодсказки = "", Владелец = Неопределено, Кнопки = Неопределено, КнопкаПоУмолчанию = "ОК", Заголовок = "", ДополнительныеПараметры = Неопределено) Экспорт
	
	СписокКнопок = Новый СписокЗначений;
	
	Если Кнопки = РежимДиалогаВопрос.ДаНет Тогда
		СписокКнопок.Добавить("Да");
		СписокКнопок.Добавить("Нет");
	ИначеЕсли Кнопки = РежимДиалогаВопрос.ОКОтмена Тогда
		СписокКнопок.Добавить("ОК");
		СписокКнопок.Добавить("Отмена");
	ИначеЕсли Кнопки = РежимДиалогаВопрос.ОК Тогда
		СписокКнопок.Добавить("ОК");
	ИначеЕсли ТипЗнч(Кнопки) = Тип("Строка") Тогда
		Для Каждого Кнопка Из Новый Структура(Кнопки) Цикл
			СписокКнопок.Добавить(Кнопка.Ключ);
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресДереваЗначений",	АдресДереваЗначений);
	ПараметрыФормы.Вставить("Кнопки",				СписокКнопок);
	ПараметрыФормы.Вставить("КнопкаПоУмолчанию",	Строка(КнопкаПоУмолчанию));
	ПараметрыФормы.Вставить("Заголовок",			Заголовок);
	ПараметрыФормы.Вставить("ТекстПодсказки",		ТекстПодсказки);
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Для Каждого ДополнительныйПараметр Из ДополнительныеПараметры Цикл
			ПараметрыФормы.Вставить(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);		
		КонецЦикла;
	КонецЕсли;
	
	КодВозврата				= Неопределено;
	ДополнительныеПараметры = Неопределено;	
	
	РезультатОткрытия = ОткрытьФормуМодально("ОбщаяФорма.ФормаДереваЗначений", ПараметрыФормы, Владелец);
	Если ТипЗнч(РезультатОткрытия) = Тип("Структура") Тогда
		ДополнительныеПараметры = РезультатОткрытия;
		ДополнительныеПараметры.Свойство("КодВозврата", КодВозврата); 
	КонецЕсли;
	
	Возврат КодВозврата;

КонецФункции

#Область Работа_с_хранилищем_вариантов_и_настроек_отчетов

// Открывает форму для выбора сохраняемых настроек в хранилище вариантов и настроек отчетов
//
// Параметры:
//	КлючОбъекта					- Строка						- ключ объекта
//	КлючТекущихНастроек			- Строка						- ключ текущих настроек
//	Организация					- СправочникСсылка.Организации	- для выбора настроек указанной организации
//								- Неопределено					- для выбора настроек текущей организации пользователя
//	ОбновитьКлючТекущихНастроек	- Булево						- при выборе настроек параметру КлючТекущихНастроек будет присвоено значение ключа выбранных настроек
//
// Возвращаемое значение:
//	ВыборНастроек	- выбранное значение
//	Неопределено	- если настройки не были выбраны
//
Функция ВыбратьСохраняемыеНастройкиИзХранилищаВариантовИНастроекОтчетов(КлючОбъекта, КлючТекущихНастроек, Организация = Неопределено, ОбновитьКлючТекущихНастроек = Истина) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючОбъекта",			КлючОбъекта);
	ПараметрыФормы.Вставить("КлючТекущихНастроек",	КлючТекущихНастроек);
	ПараметрыФормы.Вставить("Организация",			Организация);
	
	ВыборНастроек = ОткрытьФормуМодально("ХранилищеНастроек.ХранилищеВариантовИНастроекОтчетов.ФормаСохранения", ПараметрыФормы);
	
	Если ТипЗнч(ВыборНастроек) = Тип("ВыборНастроек") И ОбновитьКлючТекущихНастроек Тогда

		КлючТекущихНастроек = ВыборНастроек.КлючНастроек;
		
	КонецЕсли;
		
	Возврат ВыборНастроек;
	
КонецФункции

// Открывает форму для выбора настроек в хранилище вариантов и настроек отчетов и сохраняет в нем переданные настройки по выбранному ключу
//
// Параметры:
//	КлючОбъекта					- Строка						- ключ объекта
//	КлючТекущихНастроек			- Строка						- ключ текущих настроек
//	Настройки					- Произвольный					- сохраняемые настройки
//	Организация					- СправочникСсылка.Организации	- для выбора настроек указанной организации
//								- Неопределено					- для выбора настроек текущей организации пользователя
//	ОбновитьКлючТекущихНастроек	- Булево						- при выборе настроек параметру КлючТекущихНастроек будет присвоено значение ключа выбранных настроек
//
// Возвращаемое значение:
//	ВыборНастроек	- выбранное значение
//	Неопределено	- если настройки не были выбраны
//
Функция СохранитьНастройкиВХранилищеВариантовИНастроекОтчетов(КлючОбъекта, КлючТекущихНастроек, Настройки, Организация = Неопределено, ОбновитьКлючТекущихНастроек = Истина) Экспорт
	
	ВыборНастроек = ВыбратьСохраняемыеНастройкиИзХранилищаВариантовИНастроекОтчетов(КлючОбъекта, КлючТекущихНастроек, Организация, ОбновитьКлючТекущихНастроек);
	
	Если ТипЗнч(ВыборНастроек) = Тип("ВыборНастроек") Тогда
		
		РаботаСХранилищем.ХранилищеВариантовИНастроекОтчетовСохранить(КлючОбъекта, ВыборНастроек.КлючНастроек, Настройки);
		
	КонецЕсли;
	
	Возврат ВыборНастроек;
	
КонецФункции

// Открывает форму для выбора настроек в хранилище вариантов и настроек отчетов и сохраняет в нем переданные по адресу во временном хранилище настройки по выбранному ключу
//
// Параметры:
//	КлючОбъекта						- Строка						- ключ объекта
//	КлючТекущихНастроек				- Строка						- ключ текущих настроек
//	АдресНастроек					- Строка						- адрес сохраняемых настроек во временном хранилище
//	Организация						- СправочникСсылка.Организации	- для выбора настроек указанной организации
//									- Неопределено					- для выбора настроек текущей организации пользователя
//	ОбновитьКлючТекущихНастроек		- Булево						- при выборе настроек параметру КлючТекущихНастроек будет присвоено значение ключа выбранных настроек
//	УдалитьИзВременногоХранилища	- Булево						- после сохранения настройки из временного хранилища будут удалены
//
// Возвращаемое значение:
//	ВыборНастроек	- выбранное значение
//	Неопределено	- если настройки не были выбраны
//
Функция СохранитьНастройкиИзВременногоХранилищаВХранилищеВариантовИНастроекОтчетов(КлючОбъекта, КлючТекущихНастроек, АдресНастроек, Организация = Неопределено, ОбновитьКлючТекущихНастроек = Истина, УдалитьИзВременногоХранилища = Истина) Экспорт
	
	ВыборНастроек = ВыбратьСохраняемыеНастройкиИзХранилищаВариантовИНастроекОтчетов(КлючОбъекта, КлючТекущихНастроек, Организация, ОбновитьКлючТекущихНастроек);
	
	Если ТипЗнч(ВыборНастроек) = Тип("ВыборНастроек") Тогда
		
		РаботаСХранилищем.ХранилищеВариантовИНастроекОтчетовСохранитьИзВременногоХранилища(КлючОбъекта, ВыборНастроек.КлючНастроек, АдресНастроек, , , , УдалитьИзВременногоХранилища);
		
	КонецЕсли;
	
	Возврат ВыборНастроек;
	
КонецФункции

// Открывает форму для выбора загружаемых настроек из хранилища вариантов и настроек отчетов
//
// Параметры:
//	КлючОбъекта					- Строка						- ключ объекта
//	КлючТекущихНастроек			- Строка						- ключ текущих настроек
//	Организация					- СправочникСсылка.Организации	- для выбора настроек указанной организации
//								- Неопределено					- для выбора настроек текущей организации пользователя
//	ОбновитьКлючТекущихНастроек	- Булево						- при выборе настроек параметру КлючТекущихНастроек будет присвоено значение ключа выбранных настроек
//
// Возвращаемое значение:
//	ВыборНастроек	- выбранное значение
//	Неопределено	- если настройки не были выбраны
//
Функция ВыбратьЗагружаемыеНастройкиИзХранилищаВариантовИНастроекОтчетов(КлючОбъекта, КлючТекущихНастроек, Организация = Неопределено, ОбновитьКлючТекущихНастроек = Истина) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючОбъекта",			КлючОбъекта);
	ПараметрыФормы.Вставить("КлючТекущихНастроек",	КлючТекущихНастроек);
	ПараметрыФормы.Вставить("Организация",			Организация);
	
	ВыборНастроек = ОткрытьФормуМодально("ХранилищеНастроек.ХранилищеВариантовИНастроекОтчетов.ФормаЗагрузки", ПараметрыФормы);
	
	Если ТипЗнч(ВыборНастроек) = Тип("ВыборНастроек") И ОбновитьКлючТекущихНастроек Тогда

		КлючТекущихНастроек = ВыборНастроек.КлючНастроек;
		
	КонецЕсли;
		
	Возврат ВыборНастроек;
	
КонецФункции

// Открывает форму для выбора настроек в хранилище вариантов и настроек отчетов и возращает настройки из него по выбранному ключу
//
// Параметры:
//	КлючОбъекта					- Строка						- ключ объекта
//	КлючТекущихНастроек			- Строка						- ключ текущих настроек
//	Организация					- СправочникСсылка.Организации	- для выбора настроек указанной организации
//								- Неопределено					- для выбора настроек текущей организации пользователя
//	ОбновитьКлючТекущихНастроек	- Булево						- при выборе настроек параметру КлючТекущихНастроек будет присвоено значение ключа выбранных настроек
//
// Возвращаемое значение:
//	Структура - описание настроек с ключами:
//		- КлючНастроек	- Строка		- ключ настроек
//		- Настройки		- Произвольный	- полученные настройки
//	Неопределено - если настройки не были выбраны
//
Функция ПолучитьНастройкиИзХранилищаВариантовИНастроекОтчетов(КлючОбъекта, КлючТекущихНастроек, Организация = Неопределено, ОбновитьКлючТекущихНастроек = Истина) Экспорт
	
	Перем ОписаниеРезультата;
	
	ВыборНастроек = ВыбратьЗагружаемыеНастройкиИзХранилищаВариантовИНастроекОтчетов(КлючОбъекта, КлючТекущихНастроек, Организация, ОбновитьКлючТекущихНастроек);
	
	Если ТипЗнч(ВыборНастроек) = Тип("ВыборНастроек") Тогда

		Настройки = РаботаСХранилищем.ХранилищеВариантовИНастроекОтчетовЗагрузить(КлючОбъекта, КлючТекущихНастроек);
		
		ОписаниеРезультата = Новый Структура("КлючНастроек, Настройки", ВыборНастроек.КлючНастроек, Настройки);
		
	КонецЕсли;
	
	Возврат ОписаниеРезультата;
	
КонецФункции

// Открывает форму для выбора настроек в хранилище вариантов и настроек отчетов и помещает настройки из него по выбранному ключу во временное хранилище
//
// Параметры:
//	КлючОбъекта					- Строка						- ключ объекта
//	КлючТекущихНастроек			- Строка						- ключ текущих настроек
//	Организация					- СправочникСсылка.Организации	- для выбора настроек указанной организации
//								- Неопределено					- для выбора настроек текущей организации пользователя
//	ОбновитьКлючТекущихНастроек	- Булево						- при выборе настроек параметру КлючТекущихНастроек будет присвоено значение ключа выбранных настроек
//
// Возвращаемое значение:
//	Структура - описание настроек с ключами:
//		- КлючНастроек						- Строка	- ключ настроек
//		- АдресНастроекВоВременномХранилище	- Строка	- адрес во временном хранилище полученных настроек
//	Неопределено - если настройки не были выбраны
//
Функция ПоместитьНастройкиИзХранилищаВариантовИНастроекОтчетовВоВременноеХранилище(КлючОбъекта, КлючТекущихНастроек, АдресНастроек, Организация = Неопределено, ОбновитьКлючТекущихНастроек = Истина) Экспорт
	
	Перем ОписаниеРезультата;
	
	ВыборНастроек = ВыбратьЗагружаемыеНастройкиИзХранилищаВариантовИНастроекОтчетов(КлючОбъекта, КлючТекущихНастроек, Организация, ОбновитьКлючТекущихНастроек);
	
	Если ТипЗнч(ВыборНастроек) = Тип("ВыборНастроек") Тогда

		АдресНастроекВоВременномХранилище = РаботаСХранилищем.ХранилищеВариантовИНастроекОтчетовЗагрузитьВоВременноеХранилище(КлючОбъекта, КлючТекущихНастроек, АдресНастроек);
		
		ОписаниеРезультата = Новый Структура("КлючНастроек, АдресНастроекВоВременномХранилище", ВыборНастроек.КлючНастроек, АдресНастроекВоВременномХранилище);
		
	КонецЕсли;

	Возврат ОписаниеРезультата;

КонецФункции

#КонецОбласти

#Область Общие_обработчики_событий

Процедура СостояниеДокументаОбработкаНавигационнойСсылки(Форма, ОсновнойРеквизит, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт

	СтандартнаяОбработка = Ложь;
	
	// Получаем навигационные ссылки закрытых счетов д/у	
	
	НавигационныеСсылки = СтрРазделить(НавигационнаяСсылкаФорматированнойСтроки, "|");
	
	Если НавигационныеСсылки.Количество() = 1 Тогда
		
		НавигационнаяСсылка = НавигационныеСсылки[0];	
		
	Иначе	
		
		ПредставленияСсылок = ПолучитьПредставленияНавигационныхСсылок(НавигационныеСсылки);
	
		СписокСчетов = Новый СписокЗначений;
		Для Каждого ПредставлениеСсылки Из ПредставленияСсылок Цикл
			СписокСчетов.Добавить(ПредставлениеСсылки.НавигационнаяСсылка, ПредставлениеСсылки.Текст);
		КонецЦикла;
		
		ЭлементСписка = СписокСчетов.ВыбратьЭлемент("Список счетов д/у");
		Если ЭлементСписка = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		НавигационнаяСсылка = ЭлементСписка.Значение;

	КонецЕсли;	
	
	// Открываем форму с датами запрета
	
	СчетДоверительногоУправления = СистемныеФункции.ПолучитьСсылкуПоНавигационнойСсылке(НавигационнаяСсылка);
	
	ПараметрыФормы = Новый Структура("ОтображатьБухгалтерскийУчет, ОтображатьНалоговыйУчет, ОтображатьЕдиныйБухгалтерскийУчет");
	ПараметрыФормы.Вставить("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	ПараметрыФормы.Вставить("Организация",					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетДоверительногоУправления, "Организация"));

	ОткрытьФормуМодально("РегистрСведений.ДатыЗапретаРедактирования.Форма.НастройкиДатЗапрета", ПараметрыФормы, Форма);
	
	// Обновляем статус документа
	
	ТекстЗапрета = Неопределено;
		
	Если РаботаСДокументами.ЗапретРедактированияДокумента(ОсновнойРеквизит, , , Ложь, ТекстЗапрета) Тогда

		РаботаСДокументамиКлиентСервер.УстановитьСостояниеДокумента(Форма, ТекстЗапрета, "ДатаЗапретаРедактирования");

	ИначеЕсли Форма.ТолькоПросмотр Тогда

		// Т.к. неизвестны все причины, по которым форма открыта только для просмотра,
		// можем только переоткрыть ее
		
		ИмяФормы					= Форма.ИмяФормы;
		Параметры					= Новый Структура("Ключ", Форма.Параметры.Ключ);
		МодальныйРежим				= Форма.МодальныйРежим;
		ВладелецФормы				= Форма.ВладелецФормы;
		КлючУникальности			= Форма.КлючУникальности;
		Окно						= Форма.Окно;
		РежимОткрытияОкна			= Форма.РежимОткрытияОкна;
		
		Форма.Закрыть();
		
		Если МодальныйРежим Тогда
			ОткрытьФормуМодально(ИмяФормы, Параметры, ВладелецФормы);
		Иначе
			ОткрытьФорму(ИмяФормы, Параметры, ВладелецФормы, КлючУникальности, Окно, , , РежимОткрытияОкна);
		КонецЕсли;

	Иначе

		РаботаСДокументамиКлиентСервер.УстановитьСостояниеДокумента(Форма, ТекстЗапрета, "ДатаЗапретаРедактирования");
		
	КонецЕсли;
		
КонецПроцедуры		

#КонецОбласти

#Область Работа_с_шаблонами

Процедура ПриВыбореШаблона(Форма, Команда) Экспорт
	
	МассивИмяКоманды = СтрРазделить(Команда.Имя, "_");
	
	ИмяРеквизита	= МассивИмяКоманды[0];
	Идентификатор	= МассивИмяКоманды[2];
	
	Если Команда.ИспользуемаяТаблица = Неопределено Тогда
		ИмяЭлемента = ИмяРеквизита;  
	Иначе
		ИмяЭлемента = Команда.ИспользуемаяТаблица.Имя + ИмяРеквизита;  
	КонецЕсли;
	
	Шаблон = Форма["СписокШаблонов_" + ИмяЭлемента].НайтиПоИдентификатору(Идентификатор);
	Если Шаблон <> Неопределено Тогда
		Если Команда.ИспользуемаяТаблица = Неопределено Тогда
			Форма.Объект[ИмяРеквизита] = Шаблон.Значение;
		Иначе
			Команда.ИспользуемаяТаблица.ТекущиеДанные[ИмяРеквизита] = Шаблон.Значение;
		КонецЕсли;
		
		Форма.Модифицированность = Истина;

	КонецЕсли;
КонецПроцедуры

#КонецОбласти

Процедура РасшифроватьРасчетПроцентныхПоказателей(Объект, ЭтаФорма) Экспорт

	Если Объект.Рынок <> ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расшифровка расчета доступна только для облигаций");
		Возврат;
	КонецЕсли; 
	
	ЭтоИсполнение = (ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке"));
	ЭтоПоставка = (ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг"));
	ЭтоСделка = (ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.Сделка"));
	
	Если НЕ ЭтоИсполнение И НЕ ЭтоСделка И НЕ ЭтоПоставка Тогда
		Возврат;
	КонецЕсли;
	
	Сделка = ?(ЭтоСделка, Объект.Ссылка, Объект.Основание);
	
	ЭтоПродажа = ?(ЭтоПоставка, Объект.ВидДвижения = ПредопределенноеЗначение("Перечисление.ВидыДвижений.Расход"), Объект.ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Продажа"));
	ЭтоПокупка = ?(ЭтоПоставка, Объект.ВидДвижения = ПредопределенноеЗначение("Перечисление.ВидыДвижений.Приход"), Объект.ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка"));
	
	Если ЭтоПродажа Тогда
	
		СписокПартий = БухгалтерскийУчетЕПС.ПолучитьСписокПроданныхПартийПоРегистратору(Объект.Ссылка);
		
		Если СписокПартий.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет движений по регистру ""Партии ценных бумаг""");
			Возврат;
		КонецЕсли;
		
		ЭлементСпискаПартий =  СписокПартий.ВыбратьЭлемент("Партия");
		Если ЭлементСпискаПартий = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрали партию");
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура("ДатаПереоценки, Организация, СчетДоверительногоУправления, 
			|Количество, ОценочнаяСуммаКупона, ЦеннаяБумага, Партия, СтрокаПартии, УчетныйАктивЕПС, Стоимость",
			Объект.Дата,
			Объект.Организация,
			Объект.СчетДоверительногоУправления,
			ЭлементСпискаПартий.Значение.Количество,
			ЭлементСпискаПартий.Значение.ОценочнаяСуммаКупона,
			ЭлементСпискаПартий.Значение.ЦеннаяБумага,
			ЭлементСпискаПартий.Значение.Партия,
			ЭлементСпискаПартий.Значение.СтрокаПартии,
			ЭлементСпискаПартий.Значение.УчетныйАктивЕПС,
			ЭлементСпискаПартий.Значение.Стоимость);
			
	ИначеЕсли ЭтоПокупка Тогда
		
		УчетныеАктивы = БухгалтерскийУчетЕПС.ОпределитьУчетныеАктивыЕПСДляСделки(Сделка);
		Если УчетныеАктивы.Количество() = 1 Тогда
			УчетныйАктивЕПС = УчетныеАктивы[0];
		Иначе
			СписокУчетныеАктивы = Новый СписокЗначений();
			СписокУчетныеАктивы.ЗагрузитьЗначения(УчетныеАктивы);
			ЭлементСписокУчетныеАктивы = СписокУчетныеАктивы.ВыбратьЭлемент("Выберите учетный актив");
			Если ЭлементСписокУчетныеАктивы = Неопределено Тогда
				Возврат;
			КонецЕсли;
			УчетныйАктивЕПС = ЭлементСписокУчетныеАктивы.Значение;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура("ДатаПереоценки, Организация, СчетДоверительногоУправления, 
			|Количество, ОценочнаяСуммаКупона, ЦеннаяБумага, Партия, СтрокаПартии, УчетныйАктивЕПС",
			Объект.Дата,
			Объект.Организация,
			Объект.СчетДоверительногоУправления,
			ЭтаФорма.ЦенныеБумагиКоличество1,
			ЭтаФорма.ЦенныеБумагиСуммаКупона1,
			ЭтаФорма.ЦенныеБумагиЦеннаяБумага1,
			Объект.Ссылка,
			1,
			УчетныйАктивЕПС);
			
	КонецЕсли;
	
	ОткрытьФорму("Отчет.РасшифровкаРасчетаАмортизацииДисконтаПремииИКорректировкиПоЭСП.Форма.Форма", ПараметрыФормы, ЭтаФорма, ЭтаФорма,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)

КонецПроцедуры

Функция ПроверитьИВывестиОповещениеОПроверкеПартийПриИзмененииДатЗапрета(ДанныеПроверки) Экспорт

	ВыводитьСостояние = БухгалтерскийУчет.ДатаЗапретаПартийПереноситсяВперед(ДанныеПроверки);
	
	Если ВыводитьСостояние Тогда
	
		Состояние("Проверка партий... Ждите...");
	
	КонецЕсли;
	
	Возврат ВыводитьСостояние;

КонецФункции
